cases/chpt4-bis-Marg-Off/0/delH
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      delH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 115003.175; // 28.3 C

boundaryField
{
    hot
    {
      type   fixedValue;
      value  uniform 167748.725;
    } 
    top
    {
      type   fixedValue;
      value  uniform 84858.175; 
    }
    btm
    {
      type   zeroGradient; 
    }
    cold
    {
      type   zeroGradient;
    }
    hotTop
    {
        type            zeroGradient;
    }
    coldTop
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}           

// ************************************************************************* //
